# ViewLinksInBlue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..ViewLinksInBlue Property
PDFExportOptions Class See Also
---
Whether set view links blue.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool ViewLinksInBlue { get; set; }
```

Visual Basic
---
```text
Public Property ViewLinksInBlue As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ViewLinksInBlue {
	bool get ();
	void set (bool value);
}
```

# Remarks
If true, links will be visible as blue. If false, they retain their default text color.
# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace